In [5]:
import pandas as pd

star_birthday_list = [['Taylor Swift', 'December 13, 1989', 'Singer-songwriter'], 
                      ['Aaron Sorkin', 'June 9, 1961', 'Screenwriter'], 
                      ['Harry Potter', 'July 31, 1980', 'Wizard'],
                      ['Ji-Sung Park', 'February 25, 1981', 'Footballer']]

In [8]:
df = pd.DataFrame(star_birthday_list, columns=['name', 'birthdauy', 'occupation'])

In [9]:
df

           name          birthdauy         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer